Does higher share of urban population lead to larger road mortality?

higher urban population => more cars and bigger density => more deaths on the roads

In [54]:
import warnings
import numpy as np
warnings.filterwarnings('ignore')
import pandas as pd
from plotnine import *
import statsmodels.api as sm
import statsmodels.formula.api as smf
import os
import sys
from stargazer.stargazer import Stargazer
from IPython.core.display import HTML

In [55]:
#read the data
urban_population = pd.read_csv("54950768-904f-4ec9-bd47-342e9e801985_Data.csv")
road_incidents = pd.read_csv("death-rates-road-incidents.csv")
print(road_incidents.head())

        Entity Code  Year  \
0  Afghanistan  AFG  1990
1  Afghanistan  AFG  1991
2  Afghanistan  AFG  1992
3  Afghanistan  AFG  1993
4  Afghanistan  AFG  1994

   Deaths - Road injuries - Sex: Both - Age: Age-standardized (Rate)
0                                          52.262263
1                                          52.597034
2                                          52.484181
3                                          54.153250
4                                          57.190504

In [56]:
print(urban_population.head(10))

   Time Time Code         Country Name Country Code  \
0  1992    YR1992          Afghanistan          AFG
1  1992    YR1992              Albania          ALB
2  1992    YR1992              Algeria          DZA
3  1992    YR1992       American Samoa          ASM
4  1992    YR1992              Andorra          AND
5  1992    YR1992               Angola          AGO
6  1992    YR1992  Antigua and Barbuda          ATG
7  1992    YR1992            Argentina          ARG
8  1992    YR1992              Armenia          ARM
9  1992    YR1992                Aruba          ABW

  Urban population (% of total population) [SP.URB.TOTL.IN.ZS]
0                                             21.355
1                                             37.249
2                                             53.657
3                                             82.789
4                                             94.324
5                                             40.039
6                                             35.085
7                                             87.542
8                                             66.878
9                                             49.998

In [57]:
urban_population.columns

Index(['Time', 'Time Code', 'Country Name', 'Country Code',
       'Urban population (% of total population) [SP.URB.TOTL.IN.ZS]'],
      dtype='object')

In [58]:
road_incidents.columns

Index(['Entity', 'Code', 'Year',
       'Deaths - Road injuries - Sex: Both - Age: Age-standardized (Rate)'],
      dtype='object')

In [59]:
cols_to_drop = ['Time Code']
urban_population.drop(columns=cols_to_drop, axis=1, inplace=True)

In [60]:
urban_population.head()

,Time,Country Name,Country Code,Urban population (% of total population) [SP.URB.TOTL.IN.ZS]
0,1992,Afghanistan,AFG,21.355
1,1992,Albania,ALB,37.249
2,1992,Algeria,DZA,53.657
3,1992,American Samoa,ASM,82.789
4,1992,Andorra,AND,94.324

In [61]:
cols = {'Urban population (% of total population) [SP.URB.TOTL.IN.ZS]':'urbpop',
          'Time':'year',
        'Country Name':'country',
           'Country Code':'ccode'}
urban_population.rename(columns=cols, inplace=True)

In [62]:
urban_population.columns

Index(['year', 'country', 'ccode', 'urbpop'], dtype='object')

In [63]:
road_incidents.columns

Index(['Entity', 'Code', 'Year',
       'Deaths - Road injuries - Sex: Both - Age: Age-standardized (Rate)'],
      dtype='object')

In [64]:
cols = {'Deaths - Road injuries - Sex: Both - Age: Age-standardized (Rate)':'incidents',
          'Year':'year',
        'Entity':'country',
           'Code':'ccode'}
road_incidents.rename(columns=cols, inplace=True)

In [65]:
road_incidents.columns

Index(['country', 'ccode', 'year', 'incidents'], dtype='object')

In [66]:
urban_population.tail(10)

,year,country,ccode,urbpop
5854,2018,Virgin Islands (U.S.),VIR,95.721
5855,2018,West Bank and Gaza,PSE,76.164
5856,2018,"Yemen, Rep.",YEM,36.642
5857,2018,Zambia,ZMB,43.521
5858,2018,Zimbabwe,ZWE,32.209
5859,NaN,NaN,NaN,NaN
5860,NaN,NaN,NaN,NaN
5861,NaN,NaN,NaN,NaN
5862,Data from database: World Development Indicators,NaN,NaN,NaN
5863,Last Updated: 03/19/2021,NaN,NaN,NaN

In [67]:
urban_population.drop(index=[5859,5860,5861,5862,5863],axis=0,inplace=True)

In [77]:
urban_population.tail(10)

      year                country ccode  urbpop
5849  2018                Uruguay   URY  95.334
5850  2018             Uzbekistan   UZB  50.478
5851  2018                Vanuatu   VUT  25.274
5852  2018          Venezuela, RB   VEN  88.208
5853  2018                Vietnam   VNM  35.919
5854  2018  Virgin Islands (U.S.)   VIR  95.721
5855  2018     West Bank and Gaza   PSE  76.164
5856  2018            Yemen, Rep.   YEM  36.642
5857  2018                 Zambia   ZMB  43.521
5858  2018               Zimbabwe   ZWE  32.209

In [79]:
road_incidents.tail(10)

       country ccode  year  incidents
6458  Zimbabwe   ZWE  2008  34.054126
6459  Zimbabwe   ZWE  2009  33.574161
6460  Zimbabwe   ZWE  2010  32.618256
6461  Zimbabwe   ZWE  2011  31.095035
6462  Zimbabwe   ZWE  2012  29.621973
6463  Zimbabwe   ZWE  2013  28.430509
6464  Zimbabwe   ZWE  2014  27.365695
6465  Zimbabwe   ZWE  2015  26.684043
6466  Zimbabwe   ZWE  2016  26.051148
6467  Zimbabwe   ZWE  2017  25.377666

In [89]:
road_incidents.year.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016, 2017])

In [94]:
urban_population.year.unique()

array(['1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999',
       '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015',
       '2016', '2017', '2018'], dtype=object)

In [96]:
urban_population = urban_population[urban_population.year != '2018']

In [97]:
urban_population.year.unique()

array(['1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999',
       '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015',
       '2016', '2017'], dtype=object)

In [108]:
road_incidents = road_incidents[(road_incidents.year != 1990) & (road_incidents.year != 1991)]

In [109]:
road_incidents.year.unique()

array([1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015, 2016, 2017])

In [ ]:
#dealing with nan

In [119]:
urban_population.replace('..',np.NaN,inplace=True)

In [125]:
urban_population.isnull().sum()

year       0
country    0
ccode      0
urbpop     0
dtype: int64

In [124]:
urban_population.groupby('country').agg(lambda x: x.isnull().sum()).sort_values(['urbpop'],ascending=False).head(20)

                          year  ccode  urbpop
country
Afghanistan                  0      0       0
Namibia                      0      0       0
Nepal                        0      0       0
Netherlands                  0      0       0
New Caledonia                0      0       0
New Zealand                  0      0       0
Nicaragua                    0      0       0
Niger                        0      0       0
Nigeria                      0      0       0
North Macedonia              0      0       0
Northern Mariana Islands     0      0       0
Norway                       0      0       0
Oman                         0      0       0
Pakistan                     0      0       0
Palau                        0      0       0
Panama                       0      0       0
Papua New Guinea             0      0       0
Paraguay                     0      0       0
Peru                         0      0       0
Philippines                  0      0       0

In [123]:
#dropping Kosovo, St Martin and Eritrea
cond1=urban_population.country != 'Kosovo'
cond2=urban_population.country != 'St. Martin (French part)'
cond3=urban_population.country != 'Eritrea'
condition=cond1 & cond2 & cond3
urban_population = urban_population[condition]

In [126]:
urban_population.year=pd.to_numeric(urban_population.year)
urban_population.urbpop=pd.to_numeric(urban_population.urbpop)

In [127]:
for i in urban_population.columns:
    print(i,type(urban_population.loc[1,i]))

year <class 'numpy.int64'>
country <class 'str'>
ccode <class 'str'>
urbpop <class 'numpy.float64'>

In [146]:
road_incidents.replace('..',np.NaN,inplace=True)

In [147]:
for i in road_incidents.columns:
    print(i,type(road_incidents.loc[2,i]))

country <class 'str'>
ccode <class 'str'>
year <class 'numpy.int64'>
incidents <class 'numpy.float64'>

In [145]:
road_incidents.isnull().sum()

country        0
ccode        910
year           0
incidents      0
dtype: int64

In [149]:
road_incidents.groupby('country').agg(lambda x: x.isnull().sum()).sort_values(['ccode'],ascending=False).head(20)

                                                  ccode  year  incidents
country
Eastern Sub-Saharan Africa                           26     0        0.0
North Africa and Middle East                         26     0        0.0
Northern Ireland                                     26     0        0.0
Central Asia                                         26     0        0.0
Central Europe                                       26     0        0.0
Central Europe, Eastern Europe, and Central Asia     26     0        0.0
Central Latin America                                26     0        0.0
Central Sub-Saharan Africa                           26     0        0.0
Sub-Saharan Africa                                   26     0        0.0
Oceania                                              26     0        0.0
High-middle SDI                                      26     0        0.0
Southern Sub-Saharan Africa                          26     0        0.0
Southern Latin America                               26     0        0.0
Southeast Asia, East Asia, and Oceania               26     0        0.0
Southeast Asia                                       26     0        0.0
High-income Asia Pacific                             26     0        0.0
High-income                                          26     0        0.0
South Asia                                           26     0        0.0
High SDI                                             26     0        0.0
East Asia                                            26     0        0.0

In [150]:
frames=[urban_population,road_incidents]
data=pd.merge(urban_population,road_incidents,on=['ccode','year'],how='inner')

In [157]:
data.head()

   year       country_x ccode  urbpop       country_y  incidents
0  1992     Afghanistan   AFG  21.355     Afghanistan  52.484181
1  1992         Albania   ALB  37.249         Albania  12.885809
2  1992         Algeria   DZA  53.657         Algeria  33.742905
3  1992  American Samoa   ASM  82.789  American Samoa  11.941988
4  1992         Andorra   AND  94.324         Andorra   8.722674

In [158]:
data.drop(columns='country_y',inplace=True,axis=1)

In [159]:
cols = {'country_x':'country'}
data.rename(columns=cols, inplace=True)

In [160]:
data.tail()

      year                country ccode  urbpop  incidents
5013  2017  Virgin Islands (U.S.)   VIR  95.603  11.166470
5014  2017     West Bank and Gaza   PSE  75.894   8.547896
5015  2017            Yemen, Rep.   YEM  36.016  38.422872
5016  2017                 Zambia   ZMB  42.976  19.812104
5017  2017               Zimbabwe   ZWE  32.237  25.377666